#include <stdio.h>

main()
{
	/* δημιουργια μεταβλητης τυπου file*/
	FILE *in;
	in =fopen("xxx.in","r");
	/*Δήλωση Μεταβλητών Times[Πλήθος παιδιών] c,d[μετρητές για τις for] child[παιδιών]*/
	int times,c,d,child=0;
	fscanf(in,"%d",&times); /*Διάβασμα πλήθους παιδιών*/
	times-=1; /*Μείωση κατα ένα[λόγω εκκίνησης αρίθμησης πινάκων απο το μηδέν]*/
	int rev[times],dat[times]; /*Δηλώση δυο λιστών rev και dat με μέγεθος N [Times]*/
	for(c=0;c<=times;c++) fscanf(in,"%d",(rev+c)); /*Λαμβάνουμε τα δεδομένα διαδοχικά απο το αρχείο*/
	fclose(in); /*Κλείσιμο αρχείου*/
	int max=*(dat+times); /*Μεταβλητή max ιση με το ύψος του πρώτου παιδιού*/
	for(c=times,d=0;c>=0,d<=times;c--,d++) *(dat+d) = *(rev+c); /*Αντιστροφή λίστας [λόγω ευκολίας διαχείρισης των δεδομένων[Από το πρώτο παιδί στο τελευταίο]]*/
	for(c=1;c<=times;c++) if(*(dat+c) < max) max=*(dat+c),child++;
	/*Ελενχος του ύψους και αν βλέπουν το κυλικείο με την μέθοδο της μεγαλύτερης τιμής
	Με την μέθοδο αυτή μια μεταβλητή max ελένχεται για την τιμή της διαδοχικά με κάθε 
	Θέση του πίνακα! Αν η θέση του πίνακα είναι μικρότερη απο την μεγαλύτερη τιμή που
	εχουμε βρεί[Μεχρι την συγκεκριμένη χρονίκη στιγμη] τότε το εν λόγω παιδί μπορεί να δεί το 
	κυλικείο λόγω του ότι είναι ψηλοτερο απο όλα τα μπροστινά του παιδιά*/

	FILE *out; /*Δημιουργία μεταβλητής τύπου file*/
	out = fopen("xxx.out","w"); /*Ανοίγμα αρχείου[ρεύμα είσόδου]*/
	fprintf(out,"%d",child+1); /*Εγραφή αποτελέσματος*/
	fclose(out);/*Κλείσιμο αρχείου*/
	exit(0); /*Τερματισμός προγράμματος με κωδικό 0 [Αναμενόμενος Τερματισμός]*/
}
